Tekla Open API Reference for Tekla Structures 2025
Operation.RunMacro Method
 Starts a macro with the given name. Throws an exception if the file is not found.
Macros are saved as *.cs files in the folder defined with the XS_MACRO_DIRECTORY variable.
It is possible to run drawing macros using relative paths.
See Tekla Structures Help for more information about macros.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool RunMacro(
	string FileName
)
Public Shared Function RunMacro (
	FileName As String
) As Boolean
Parameters
FileName
Type: System.String
The name of the macro to start.
Return Value
Type: Boolean
True if the macro existed.
Examples
using Tekla.Structures.Model.Operations;
public class Example
{
       public void Example1()
       {
           Operation.RunMacro("MyModelingMacro.cs");
           Operation.RunMacro(@"..\drawings\MyDrawingMacro.cs");
       }
}
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace